---
title: Windows EXT
description: kernel
date: 2024-06-04 00:00:00
categories:
- Kernel
---

### 保护模式

###### 保护模式概述

‍保护模式分为段机制和页机制。

理解：想象一下你家的电脑就像一个大厨房，里面有很多小帮手在做不同的事情，比如煮汤、炒菜等等。保护模式就是为了保证这个大厨房的秩序和安全。首先，保护模式就像是给每个小帮手配了一套专属的工具，他们不能随便用别人的工具，也不能乱碰别人的食材。这样做的好处是，即使其中一个小帮手犯错了，也不会影响到其他小帮手(**防止一个进程访问或修改另一个进程的内存数据**)。其次，保护模式给了每个小帮手一个身份证，分成两类：一类是高级厨师，一类是普通厨师。高级厨师有更多的权限，可以做更多的事情，比如烧开水等。而普通厨师的权限就少一些，不能做一些危险的事情。这样可以防止有人乱来，比如一个不懂规矩的小帮手想烧开水，但是他只是个普通厨师，就不能执行这个操作(**内核模式具有更高的特权级别，可以执行更多的操作，而用户模式受到更多的限制**)。再来，保护模式还给了每个小帮手一个梦幻厨房，虽然实际上只有一个大厨房，但是每个小帮手都觉得自己有一个属于自己的梦幻厨房。这样就不会出现争抢厨房的情况，大家都可以安心做自己的事情(**操作系统可以为每个进程提供虚拟内存，使得每个进程都认为自己拥有连续的内存空间**)。最后，保护模式还让这些小帮手轮流工作，每个人都有自己的时间段做事情，不会出现一个人霸占厨房不肯给别人机会的情况，这样大家都有机会工作，效率也更高(**操作系统可以同时运行多个进程，并实现进程之间的时间片轮转调度，使得多个程序可以并发执行**)。

###### 段寄存器结构

段寄存器一共有CS SS DS ES FS GS LDTR TR 共8个。

当我们用汇编读写某一个地址时：

```assembly
mov dword ptr ds:[0x123456],eax
```

我们真正读写的地址是：

```assembly
ds.base+0x123456
```

段寄存器结构体如下：

```c
struct Segment
{
  WORD Selecter;  //16位段选择子           可见部分.  使用OD 或者X64dbg看段寄存器只会显示16位的段选择子可见部分.
  WORD Attribute; //16位表示的段属性, 表示了当前段寄存器是可读的可写的还是可执行的
  DWORD Base;     //32位表示的基址,表示段从哪里开始
  DWORD limit;    //32位表示,表示的是基址的长度. base + limit 可以确定一个段的大小
}
```

结构如下图：

```
[---------------------------------> 可见部分 <-----------------------------------------] [-->不可见部分<---]
+--------------------------------------------------------------------------------------------------------+
|								|								|				|				|
|								|								|				|				|

  在内核中，一个小小的错误就可能导致蓝屏，比如：读写一个无效的内存地址。为了让自己的内核程序更加健壮，强烈建议大家在编写内核程序时，使用异常处理。

  `Windows`提供了结构化异常处理机制，一般的编译器都是支持的，如下：

  ```c
  __try{
      //可能出错的代码
  }
  __except(filter_value) {
      //出错时要执行的代码
  }
  ```

  出现异常时，可根据`filter_value`的值来决定程序该如果执行，当`filter_value`的值为：

  1. `EXCEPTION_EXECUTE_HANDLER(1)`：代码进入`except`块
  2. `EXCEPTION_CONTINUE_SEARCH(0)`：不处理异常，由上一层调用函数处理
  3. `EXCEPTION_CONTINUE_EXECUTION(-1)`：回去继续执行错误处的代码

- **常用的内核内存函数**

  对内存的使用，主要就是：申请、设置、拷贝以及释放。

  | c语言  |        内核中         |
  | :----: | :-------------------: |
  | malloc | ExAllocatePoolWithTag |
  | memset |     RtlFillMemory     |
  | memcpy |     RtlMoveMemory     |
  |  free  |      ExFreePool       |

  > 请注意`ExAllocatePoolWithTag`函数的`POOL_TYPE PoolType`参数：
  >
  > ```c
  > typedef enum _POOL_TYPE {
  >   NonPagedPool,
  >   PagedPool,
  >   NonPagedPoolMustSucceed,
  >   DontUseThisType,
  >   NonPagedPoolCacheAligned,
  >   PagedPoolCacheAligned,
  >   NonPagedPoolCacheAlignedMustS
  > } POOL_TYPE;
  > ```
  >
  > `NonPagedPool`代表非分页内存，`PagedPool`代表分页内存
  >
  > 非分页内存：物理页很重要，系统不会放到硬盘上的内存（常驻，存代码）
  >
  > 分页内存：物理页没那么重要，允许把物理页写到硬盘上的内存（存数据）

- **IRQL**

  - 什么是中断请求级别：就是`CPU`在执行时会遇到中断时会执行中断程序，但是如果在执行时又遇到了中断，这时该执行哪个中断程序呢？此时就需要看两个中断的中断级别了（中断是分等级的！），如果现在`CPU`执行中断的等级高于又遇到的中断，那么就忽略这个新来的中断；否则就会终止当前的中断程序，转去执行新来的中断程序（被打断了）。
  - `IRQL`是`Windows`自己定义的一套优先级方案，与`CPU`无关，**数值越大权限越高，相同权限无法互相打断，只有更高的权限才能打断**。
  - `CPU`任何时刻必须必须在`IRQL`中处于某一等级。

  ![image](https://c65mael.github.io/myassets/IRQL.png)
  
- **内核字符串种类**

  在编写3环程序我们经常用：`CHAR(char)`/`WCHAR(wchar_t)`来分别表示宅字符串和宽字符串，用0表示结尾。但是在内核中，我们常用：`ANSI_STRING`/`UNICODE_STRING`来分别表示宅字符串和宽字符串。它们的结构如下：

  `ANSI_STRING`字符串：

  ```c
  typedef struct _STRING
  {
      USHORT Length;
      USHORT MaximumLength;
      PCHAR Buffer;
  }STRING;
  ```

  `UNICODE_STRING`字符串：

  ```c
  typedef struct _UNICODE_STRING
  {
      USHORT Length;
      USHORT MaxmumLength;
      PWSTR Buffer;
  } UNICODE_STRING;
  ```

- **内核字符串常用函数**

  符串常用的功能无非就是：创建、复制、比较以及转换等等。

  |  操作  |      ANSI_STRING字符串       |     UNICODE_STRING字符串     |
  | :----: | :--------------------------: | :--------------------------: |
  | 初始化 |      RtlInitAnsiString       |     RtlInitUnicodeString     |
  |  拷贝  |        RtlCopyString         |     RtlCopyUnicodeString     |
  |  比较  |       RtlCompareString       |   RtlCompareUnicodeString    |
  |  转换  | RtlAnsiStringToUnicodeString | RtlUnicodeStringToAnsiString |

###### 内核空间与内核模块

- 之前了解到，每个进程都有`4GB`虚拟空间，而且低`2GB`所对应的物理页基本不同；高`2GB`内存所对应的物理页基本相同（共用）

  ![image](https://c65mael.github.io/myassets/kerkj.png)

- 硬件种类繁多，不可能做一个兼容所有硬件的内核，所以，微软提供规定的接口格式，让硬件驱动人员安装规定的格式编写**驱动程序** 。

  在内核中，这些驱动程序每一个都是一个模块，称为**内核模块**，都可以加载到内核中，都遵守`PE`结构。但本质上讲，任意一个`sys`文件与内核文件没有区别。每个驱动都是一个模块。就和在`3`环的程序加载`dll`一样，加载一个贴上一个。

  ![image](https://c65mael.github.io/myassets/kermk.png)

- 做练习可以了解到入口函数为`NTSTATUS DriverEntry(PDRIVER_OBJECT driver, PUNICODE_STRING reg_path)`，需要注意它的第一个参数：

  - `DRIVER_OBJECT`（驱动对象）描述了当前该模块的一些重要信息

    ```c
    kd> dt _DRIVER_OBJECT
    nt!_DRIVER_OBJECT
       +0x000 Type             : Int2B
       +0x002 Size             : Int2B
       +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
       +0x008 Flags            : Uint4B
       +0x00c DriverStart      : Ptr32 Void    //驱动从哪里开始的
       +0x010 DriverSize       : Uint4B    //部署的驱动有多大
       +0x014 DriverSection    : Ptr32 Void
       +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
       +0x01c DriverName       : _UNICODE_STRING    //驱动叫什么名字
       +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
       +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
       +0x02c DriverInit       : Ptr32     long 
       +0x030 DriverStartIo    : Ptr32     void 
       +0x034 DriverUnload     : Ptr32     void 
       +0x038 MajorFunction    : [28] Ptr32     long 
    ```

    请注意里面的成员`DriverSection`，一个指针对应结构体的双向循环链表`LDR_DATA_TABLE_ENTRY`，它圈着内核里面的所有模块（就是查看成员`InLoadOrderLinks`就行了）
    
    ```c
    kd> dt _LDR_DATA_TABLE_ENTRY
    nt!_LDR_DATA_TABLE_ENTRY
       +0x000 InLoadOrderLinks : _LIST_ENTRY
       +0x008 InMemoryOrderLinks : _LIST_ENTRY
       +0x010 InInitializationOrderLinks : _LIST_ENTRY
       +0x018 DllBase          : Ptr32 Void
       +0x01c EntryPoint       : Ptr32 Void
       +0x020 SizeOfImage      : Uint4B
       +0x024 FullDllName      : _UNICODE_STRING
       +0x02c BaseDllName      : _UNICODE_STRING
       +0x034 Flags            : Uint4B
       +0x038 LoadCount        : Uint2B
       +0x03a TlsIndex         : Uint2B
       +0x03c HashLinks        : _LIST_ENTRY
       +0x03c SectionPointer   : Ptr32 Void
       +0x040 CheckSum         : Uint4B
       +0x044 TimeDateStamp    : Uint4B
       +0x044 LoadedImports    : Ptr32 Void
       +0x048 EntryPointActivationContext : Ptr32 Void
       +0x04c PatchInformation : Ptr32 Void
    ```
    
  - 我们使用工具将驱动加载的第一步就是先注册驱动，就是在注册表里面写上驱动，第二个参数`reg_path`就是将驱动写在注册表里面的什么地方
  
  - > 在`3`环里面，有一块内存描述线程的信息，就是`TEB`。`FS:[0]`就指向这个结构体：
    >
    > ```c
    > kd> dt _TEB
    > nt!_TEB
    >    +0x000 NtTib            : _NT_TIB
    >    +0x01c EnvironmentPointer : Ptr32 Void
    >    +0x020 ClientId         : _CLIENT_ID
    >    +0x028 ActiveRpcHandle  : Ptr32 Void
    >    +0x02c ThreadLocalStoragePointer : Ptr32 Void
    >    +0x030 ProcessEnvironmentBlock : Ptr32 _PEB
    >    +0x034 LastErrorValue   : Uint4B
    >    +0x038 CountOfOwnedCriticalSections : Uint4B
    >    +0x03c CsrClientThread  : Ptr32 Void
    >    +0x040 Win32ThreadInfo  : Ptr32 Void
    >    +0x044 User32Reserved   : [26] Uint4B
    >    +0x0ac UserReserved     : [5] Uint4B
    >    +0x0c0 WOW32Reserved    : Ptr32 Void
    >    +0x0c4 CurrentLocale    : Uint4B
    >    +0x0c8 FpSoftwareStatusRegister : Uint4B
    >    +0x0cc SystemReserved1  : [54] Ptr32 Void
    >    +0x1a4 ExceptionCode    : Int4B
    >    +0x1a8 ActivationContextStack : _ACTIVATION_CONTEXT_STACK
    >    +0x1bc SpareBytes1      : [24] UChar
    >    +0x1d4 GdiTebBatch      : _GDI_TEB_BATCH
    >    +0x6b4 RealClientId     : _CLIENT_ID
    >    +0x6bc GdiCachedProcessHandle : Ptr32 Void
    >    +0x6c0 GdiClientPID     : Uint4B
    >    +0x6c4 GdiClientTID     : Uint4B
    >    +0x6c8 GdiThreadLocalInfo : Ptr32 Void
    >    +0x6cc Win32ClientInfo  : [62] Uint4B
    >    +0x7c4 glDispatchTable  : [233] Ptr32 Void
    >    +0xb68 glReserved1      : [29] Uint4B
    >    +0xbdc glReserved2      : Ptr32 Void
    >    +0xbe0 glSectionInfo    : Ptr32 Void
    >    +0xbe4 glSection        : Ptr32 Void
    >    +0xbe8 glTable          : Ptr32 Void
    >    +0xbec glCurrentRC      : Ptr32 Void
    >    +0xbf0 glContext        : Ptr32 Void
    >    +0xbf4 LastStatusValue  : Uint4B
    >    +0xbf8 StaticUnicodeString : _UNICODE_STRING
    >    +0xc00 StaticUnicodeBuffer : [261] Uint2B
    >    +0xe0c DeallocationStack : Ptr32 Void
    >    +0xe10 TlsSlots         : [64] Ptr32 Void
    >    +0xf10 TlsLinks         : _LIST_ENTRY
    >    +0xf18 Vdm              : Ptr32 Void
    >    +0xf1c ReservedForNtRpc : Ptr32 Void
    >    +0xf20 DbgSsReserved    : [2] Ptr32 Void
    >    +0xf28 HardErrorsAreDisabled : Uint4B
    >    +0xf2c Instrumentation  : [16] Ptr32 Void
    >    +0xf6c WinSockData      : Ptr32 Void
    >    +0xf70 GdiBatchCount    : Uint4B
    >    +0xf74 InDbgPrint       : UChar
    >    +0xf75 FreeStackOnTermination : UChar
    >    +0xf76 HasFiberData     : UChar
    >    +0xf77 IdealProcessor   : UChar
    >    +0xf78 Spare3           : Uint4B
    >    +0xf7c ReservedForPerf  : Ptr32 Void
    >    +0xf80 ReservedForOle   : Ptr32 Void
    >    +0xf84 WaitingOnLoaderLock : Uint4B
    >    +0xf88 Wx86Thread       : _Wx86ThreadState
    >    +0xf94 TlsExpansionSlots : Ptr32 Ptr32 Void
    >    +0xf98 ImpersonationLocale : Uint4B
    >    +0xf9c IsImpersonating  : Uint4B
    >    +0xfa0 NlsCache         : Ptr32 Void
    >    +0xfa4 pShimData        : Ptr32 Void
    >    +0xfa8 HeapVirtualAffinity : Uint4B
    >    +0xfac CurrentTransactionHandle : Ptr32 Void
    >    +0xfb0 ActiveFrame      : Ptr32 _TEB_ACTIVE_FRAME
    >    +0xfb4 SafeThunkCall    : UChar
    >    +0xfb5 BooleanSpare     : [3] UChar
    > ```
    >
    > 可以看到，在`TEB`的成员中的`0x30`，存储着进程环境块（`PEB`）。它描述着进程里面的信息：
    >
    > ```c
    > kd> dt _PEB
    > nt!_PEB
    >    +0x000 InheritedAddressSpace : UChar
    >    +0x001 ReadImageFileExecOptions : UChar
    >    +0x002 BeingDebugged    : UChar
    >    +0x003 SpareBool        : UChar
    >    +0x004 Mutant           : Ptr32 Void
    >    +0x008 ImageBaseAddress : Ptr32 Void
    >    +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
    >    +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
    >    +0x014 SubSystemData    : Ptr32 Void
    >    +0x018 ProcessHeap      : Ptr32 Void
    >    +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
    >    +0x020 FastPebLockRoutine : Ptr32 Void
    >    +0x024 FastPebUnlockRoutine : Ptr32 Void
    >    +0x028 EnvironmentUpdateCount : Uint4B
    >    +0x02c KernelCallbackTable : Ptr32 Void
    >    +0x030 SystemReserved   : [1] Uint4B
    >    +0x034 AtlThunkSListPtr32 : Uint4B
    >    +0x038 FreeList         : Ptr32 _PEB_FREE_BLOCK
    >    +0x03c TlsExpansionCounter : Uint4B
    >    +0x040 TlsBitmap        : Ptr32 Void
    >    +0x044 TlsBitmapBits    : [2] Uint4B
    >    +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
    >    +0x050 ReadOnlySharedMemoryHeap : Ptr32 Void
    >    +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
    >    +0x058 AnsiCodePageData : Ptr32 Void
    >    +0x05c OemCodePageData  : Ptr32 Void
    >    +0x060 UnicodeCaseTableData : Ptr32 Void
    >    +0x064 NumberOfProcessors : Uint4B
    >    +0x068 NtGlobalFlag     : Uint4B
    >    +0x070 CriticalSectionTimeout : _LARGE_INTEGER
    >    +0x078 HeapSegmentReserve : Uint4B
    >    +0x07c HeapSegmentCommit : Uint4B
    >    +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
    >    +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
    >    +0x088 NumberOfHeaps    : Uint4B
    >    +0x08c MaximumNumberOfHeaps : Uint4B
    >    +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
    >    +0x094 GdiSharedHandleTable : Ptr32 Void
    >    +0x098 ProcessStarterHelper : Ptr32 Void
    >    +0x09c GdiDCAttributeList : Uint4B
    >    +0x0a0 LoaderLock       : Ptr32 Void
    >    +0x0a4 OSMajorVersion   : Uint4B
    >    +0x0a8 OSMinorVersion   : Uint4B
    >    +0x0ac OSBuildNumber    : Uint2B
    >    +0x0ae OSCSDVersion     : Uint2B
    >    +0x0b0 OSPlatformId     : Uint4B
    >    +0x0b4 ImageSubsystem   : Uint4B
    >    +0x0b8 ImageSubsystemMajorVersion : Uint4B
    >    +0x0bc ImageSubsystemMinorVersion : Uint4B
    >    +0x0c0 ImageProcessAffinityMask : Uint4B
    >    +0x0c4 GdiHandleBuffer  : [34] Uint4B
    >    +0x14c PostProcessInitRoutine : Ptr32     void 
    >    +0x150 TlsExpansionBitmap : Ptr32 Void
    >    +0x154 TlsExpansionBitmapBits : [32] Uint4B
    >    +0x1d4 SessionId        : Uint4B
    >    +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
    >    +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
    >    +0x1e8 pShimData        : Ptr32 Void
    >    +0x1ec AppCompatInfo    : Ptr32 Void
    >    +0x1f0 CSDVersion       : _UNICODE_STRING
    >    +0x1f8 ActivationContextData : Ptr32 Void
    >    +0x1fc ProcessAssemblyStorageMap : Ptr32 Void
    >    +0x200 SystemDefaultActivationContextData : Ptr32 Void
    >    +0x204 SystemAssemblyStorageMap : Ptr32 Void
    >    +0x208 MinimumStackCommit : Uint4B
    > ```
    >
    > 看`PEB`，里面`0x00c`处的`Ldr`，里面存放着`3`个链表：
    >
    > ```c
    > kd> dt _PEB_LDR_DATA
    > nt!_PEB_LDR_DATA
    >    +0x000 Length           : Uint4B
    >    +0x004 Initialized      : UChar
    >    +0x008 SsHandle         : Ptr32 Void
    >    +0x00c InLoadOrderModuleList : _LIST_ENTRY    //<=第一个（加载顺序）
    >    +0x014 InMemoryOrderModuleList : _LIST_ENTRY    //<=第二个（内存顺序）
    >    +0x01c InInitializationOrderModuleList : _LIST_ENTRY    //<=第三个（初始化顺序）
    >    +0x024 EntryInProgress  : Ptr32 Void
    > ```
    >
    > 这三个链表记录了当前进程有哪些模块，与`0`环的`LDR_DATA_TABLE_ENTRY`类似

###### 0环与3环通信(常规方式)

- **设备对象**

  我们在开发窗口程序的时候，消息被封装成一个结构体：`MSG`。在内核开发时，消息被封装成另外一个结构体：`IRP`（`I/O Request Package`）。

  在窗口程序中，能够接收消息的只能是窗口对象。在内核中，能够接收`IRP`消息的只能是设备对象。

  ![image](https://c65mael.github.io/myassets/shebeiduixiang.png)

- 通信流程

  1. **创建设备对象**

     如何理解：正常来说一个设备对象对应一个硬件，但是也可以什么都不对应，就是一个抽象的概念：只有结构体没有硬件

     ```c
     //创建设备名称
     UNICODE_STRING Devicename;
     RtlInitUnicodeString(&Devicename,L"\\Device\\MyDevice");
     
     //创建设备
     IoCreateDevice(
         pDriver,    //当前设备所属的驱动对象，一个设备对象必须属于某一个驱动对象
         0,
         &Devicename,    //设备对象的名称
         FILE_DEVICE_UNKNOWN,    //没有对应的设备就是这个UNKNOWN
         FILE_DEVICE_SECURE_OPEN,
         FALSE,
         &pDeviceObj    //设备对象指针
     );
     ```

  2. **设置交互数据的方式**

     ```c
     pDeviceObj->Flags |= DO_BUFFERED_IO;
     ```

     - 缓冲区方式读写(`DO_BUFFERED_IO`) ：操作系统将应用程序提供缓冲区的数据复制到内核模式下的地址中。

     - 直接方式读写`(DO_DIRECT_IO`) ：操作系统会将用户模式下的缓冲区锁住。然后操作系统将这段缓冲区在内核模式地址再次映射一遍。这样，用户模式的缓冲区和内核模式的缓冲区指向的是同一区域的物理内存。缺点就是要单独占用物理页面。

     - 其他方式读写（在调用`IoCreateDevice`创建设备后对`pDevObj->Flags`即不设置`DO_BUFFERED_IO`也不设置`DO_DIRECT_IO`此时就是其他方式。）

       在使用其他方式读写设备时，派遣函数直接读写应用程序提供的缓冲区地址。在驱动程序中，直接操作应用程序的缓冲区地址是很危险的。只有驱动程序与应用程序运行在相同线程上下文的情况下，才能使用这种方式。如果`CPU`中的任务切换了，即`CR3`切换掉了，在高`2GB`的驱动仍在使用该方式读取低`2GB`内存，导致读到的数据和实际不符，导致错误，故强烈不推荐此方式。

  3. **创建符号链接**

     - 就是让3环的程序找到你的驱动对象。设备名称的作用是给内核对象用的，如果要在3环访问，必须要有符号链接。其实就是一个别名，没有这个别名，在3环不可见。

       ```c
       //创建符号链接名称
       RtlInitUnicodeString(&SymbolicLinkName,L"\\??\\MyTestDriver");
       
       //创建符号链接
       IoCreateSymbolicLink(&SymbolicLinkName,&Devicename);
       ```

     - 内核模式下，符号链接是以`\??\`开头的，如C盘就是`\??\C:`。而在用户模式下，则是以`\\.\`开头的，如C盘就是`\\.\C:`

  4. **IRP**

     类比一下，在图形界面上是通过鼠标单击或双机来调用回调函数，而在内核里面则是通过调用对应的函数来执行派遣函数的

     ![image](https://c65mael.github.io/myassets/cksbduixiang.png)

     在3环调用`CreateFile`函数，操作系统就会封装一个`IRP`派发给设备对象，设备对象通过`IRP`的类型调用对应的派发函数。

     当应用层通过`CreateFile`、`ReadFile`、`WriteFile`、`CloseHandle`等函数打开、从设备读取数据、向设备写入数据、关闭设备的时候，会使操作系统分别产生出`IRP_MJ_CREATE`、`IRP_MJ_READ`、`IRP_MJ_WRITE`、`IRP_MJ_CLOSE`等不同的`IRP`。

     其他类型的`IRP`：

     |        IRP类型        |                    来源                     |
     | :-------------------: | :-----------------------------------------: |
     | IRP_MJ_DEVICE_CONTROL | 使用 DeviceControl 函数时产生（最多的方式） |
     |     IRP_MJ_POWER      |        在操作系统处理电源消息时产生         |
     |    IRP_MJ_SHUTDOWN    |              关闭系统前时产生               |

  5. **派遣函数**

     如何注册派遣函数：其实每一个`IRP`都对应一个值，那么你提供的派遣函数就应该写在成员`MajorFunction`下标对应的位置。

     ```c
     kd> dt _DRIVER_OBJECT
     ntdll!_DRIVER_OBJECT
        +0x000 Type             : Int2B
        +0x002 Size             : Int2B
        +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
        +0x008 Flags            : Uint4B
        +0x00c DriverStart      : Ptr32 Void
        +0x010 DriverSize       : Uint4B
        +0x014 DriverSection    : Ptr32 Void
        +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
        +0x01c DriverName       : _UNICODE_STRING
        +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
        +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
        +0x02c DriverInit       : Ptr32     long 
        +0x030 DriverStartIo    : Ptr32     void 
        +0x034 DriverUnload     : Ptr32     void 
        +0x038 MajorFunction    : [28] Ptr32     long 
     ```
  
     代码形式：
  
     ```c
     //设置卸载函数
     pDriverObject->DriverUnload = 卸载函数;
     
     //设置派遣函数
     pDriverObject->MajorFunction[IRP_MJ_CREATE] = 派遣函数1;
     pDriverObject->MajorFunction[IRP_MJ_CLOSE] = 派遣函数2;
     pDriverObject->MajorFunction[IRP_MJ_WRITE] = 派遣函数3;
     pDriverObject->MajorFunction[IRP_MJ_READ] = 派遣函数4;
     pDriverObject->MajorFunction[IRP_MJ_CLEANUP] = 派遣函数5;
     pDriverObject->MajorFunction[IRP_MJ_SET_INFORMATION] = 派遣函数6;
     pDriverObject->MajorFunction[IRP_MJ_DEVICE_CONTROL] = 派遣函数7;
     pDriverObject->MajorFunction[IRP_MJ_SHUTDOWN] = 派遣函数8;
     pDriverObject->MajorFunction[IRP_MJ_SYSTEM_CONTROL] = 派遣函数9;
     ```
  
     **派遣函数的格式**
  
     ```c
     NTSTATUS MyDispatchFunction(PDEVICE_OBJECT pDevObj, PIRP pIrp)
     {
         //处理自己的业务……
     
         //设置返回状态
         pIrp->IoStatus.Status = STATUS_SUCCESS;    //GetLastError() 函数得到的就是该值
